tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "dteoh/sqa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "v2ray/v2ray"
tap "vitorgalvao/tiny-scripts"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# ISO AAC audio encoder
brew "faac"
# ISO AAC audio decoder
brew "faad2"
# H.264/AVC encoder
brew "x264"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Improved top (interactive process viewer)
brew "htop"
# Interactive computing in Python
brew "ipython"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Password generator
brew "pwgen"
# Cross-platform application and UI framework
brew "qt"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# A platform for building proxies to bypass network restrictions.
brew "v2ray/v2ray/v2ray-core"
# Script to quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "adobe-creative-cloud"
cask "alfred"
cask "aliwangwang"
cask "atom"
cask "baidunetdisk"
cask "clashx"
cask "cyberduck"
cask "daisydisk"
cask "dingtalk"
cask "docker"
cask "downie"
cask "firefox"
cask "geekbench"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "handshaker"
cask "iina"
cask "imazing"
cask "intel-power-gadget"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "jdownloader"
cask "mimolive"
cask "motrix"
cask "neteasemusic"
cask "obs"
cask "onedrive"
cask "outline"
cask "outline-manager"
cask "pphelper"
cask "pycharm-ce"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qq"
cask "qqmusic"
cask "quicklook-csv"
cask "quicklook-json"
cask "shadowsocksx-ng-r"
cask "sourcetree"
cask "steam"
cask "sublime-text"
cask "sunlogincontrol"
cask "teamviewer"
cask "termius"
cask "the-unarchiver"
cask "thunder"
cask "v2rayx"
cask "virtualbox"
cask "vlc"
cask "wechat"
cask "wireshark"
cask "xiami"
cask "xquartz"
mas "ch.arizona-software.iLocalize", id: 437165919
mas "com.amazon.Kindle", id: 405399194
mas "com.apple.Compressor", id: 424390742
mas "com.apple.configurator.ui", id: 1037126344
mas "com.apple.dt.Xcode", id: 497799835
mas "com.apple.FinalCut", id: 424389933
mas "com.apple.garageband10", id: 682658836
mas "com.apple.iBooksAuthor", id: 490152466
mas "com.apple.iMovieApp", id: 408981434
mas "com.apple.iWork.Keynote", id: 409183694
mas "com.apple.iWork.Numbers", id: 409203825
mas "com.apple.iWork.Pages", id: 409201541
mas "com.apple.logic10", id: 634148309
mas "com.apple.mainstage3", id: 634159523
mas "com.apple.motionapp", id: 434290957
mas "com.apple.RemoteDesktop", id: 409907375
mas "com.blackmagic-design.DaVinciResolveLite", id: 571213070
mas "com.corel.CorelDRAW", id: 1447605203
mas "com.fobwifi.mac", id: 1345035954
mas "com.helloresolven.GIF-Brewery-3", id: 1081413713
mas "com.ideasoncanvas.mindnode.macos", id: 1289197285
mas "com.microsoft.rdc.mac", id: 715768417
mas "com.ookla.speedtest-macos", id: 1153157709
mas "com.reederapp.rkit2.mac", id: 880001334
mas "com.seriflabs.affinitydesigner", id: 824171161
mas "com.seriflabs.affinityphoto", id: 824183456
mas "com.solaria.strikemac", id: 1439733892
mas "com.Swiftify.Xcode", id: 1183412116
mas "com.twitter.TweetDeck", id: 485812721
mas "com.wireguard.macos", id: 1451685025
mas "com.wutian.weibo", id: 789066512
mas "net.ipip.besttrace4mac", id: 1037779758
mas "org.outline.macos.client", id: 1356178125
mas "org.outline.macos.client", id: 1356178125
mas "org.telegram.desktop", id: 946399090
